#### 2. 딕셔너리로 정보 조회하기 — `[데이터구조]`
# - **문제**: `student = {"이름": "김클라라", 
# "나이": 25, "전공": "컴퓨터공학"}` 딕셔너리를 만들고, 
# `키(key)`를 이용해 "이름"과 "전공"만 출력하세요.
# - 💡 **비유**: 딕셔너리는 "이름표가 붙은 사물함"이에요. 
# 번호(인덱스) 대신 "이름표(key)"로 바로 찾아 꺼낼 수 있어요.
#===================================================================================
student = {"이름": "김클라라", "나이": 25, "전공": "컴퓨터공학"}
# "이름"과 "전공"만 출력하기.
print(f"{student["이름"]}: {student["전공"]}")

print("====================================")
student_list=[f"{key}:{value}" for key,value in student.items() if key =="이름" or key == "전공"]
print(*student_list)