#### 5. 간단한 To-Do 리스트 관리 프로그램 — `[종합: 함수 + while + 데이터구조 + 제어문]`
# - **시나리오**: 사용자가 메뉴를 선택해 할 일을 추가/삭제/조회하는 콘솔 프로그램입니다.
# - **요구사항**:
#     1. `while` 반복문으로 프로그램이 계속 실행되도록 메뉴(추가/삭제/조회/종료)를 반복 출력
#     2. 각 기능을 함수로 분리: `add_task()`, `delete_task()`, `show_tasks()`
#     3. 할 일 목록은 리스트에 저장, 
#       완료 여부는 딕셔너리(`{"할일": "장보기", "완료": False}`)로 관리
#======================================================================


#관련 함수를 제작 한 뒤 함수로 작동하는 셋을 제작한다.
# 이때 while문 사용할것.
tasks=[]
#1. 추가 함수
def add_task(task):
    tasks.append({'할일':task ,'완료':False})

#2. 삭제 함수
def remove_task(index):
    if 0<= index < len(tasks):
        print(f"{})
#3. 조회 함수
#4. 완료 함수
