use hyundai;

--  [예제 6-1] 최고 마일리지를 보유한 고객의 정보를 보이시오.
select max(마일리지) from 고객;
select *
	from 고객
		where 마일리지 = (select max(마일리지) from 고객);
        
-- [예제 6-2] 주문번호 ‘H0250’을 주문한 고객에 대해 고객회사명과 
-- 담당자명을 보이시오
select *from 주문 where 주문번호 ='H0250';
select * from 고객 where 고객번호 = 'NARHA';

-- => 서브쿼리로 연결
select * from 고객 
	where 고객번호 = (select 고객번호 from 주문 where 주문번호 ='H0250');
-- => inner join으로 연결
select * from 고객
	inner join 주문 on 고객.고객번호 = 주문.고객번호
	where 주문번호 ='H0250';
-- =================================================================
-- [예제 6-3] ‘부산광역시’고객의 최소 마일리지보다 더 큰 마일리지를 가진 
-- 고객 정보를 보이시오
select min(마일리지) from 고객 where 도시 ='부산광역시';
select *
from 고객
where 마일리지 > (select min(마일리지) from 고객 where 도시 ='부산광역시');

-- 복수 행 서브쿼리 ================================================
-- [예제 6-4] ‘부산광역시’ 고객이 주문한 주문건수를 보이시오.

select 고객번호 from 고객 where 도시 = '부산광역시';
select count(*) '주문 건수' from 주문 where 고객번호 in (select 고객번호 from 고객 where 도시 = '부산광역시');

-- [예제 6-5] ‘부산광역시’ 전체 고객의 마일리지보다 마일리지가 큰 고객의 
-- 정보를 보이시오

-- 부산광역시의 전체 고객과 비교해서 하나라도 True 라면 고객의 정보를 보여라. 라는 의미?

select 마일리지 from 고객 where 도시 ='부산광역시';
select * from 고객 where 마일리지 > some (select 마일리지 from 고객 where 도시 ='부산광역시');

-- [예제 6-6] 각 지역의 어느 평균 마일리지보다도 마일리지가 큰 고객의 
-- 정보를 보이시오

select avg(마일리지) from 고객 group by 지역;
select * from 고객 where 마일리지 > some (select avg(마일리지) from 고객 group by 지역);

-- [예제 6-7] 한 번이라도 주문한 적이 있는 고객의 정보를 보이시오.
-- in 사용
select distinct 고객번호 from 주문;
select 고객번호, 고객회사명 from 고객 where 고객번호 in (select distinct 고객번호 from 주문);

-- 조인사용
select distinct 고객.고객번호, 고객.고객회사명 
from 고객 
inner join 주문 on 고객.고객번호 = 주문.고객번호;

-- exists 사용
select 고객.고객번호, 고객.고객회사명
from 고객
where exists(select * from 주문 where 주문. 고객번호 = 고객.고객번호);

-- ======================================================================================
-- 사용 위치에 따른 서브 쿼리
--  [예제 6-8] 고객 전체의 평균마일리지보다 평균마일리지가 큰 도시에 대해 
-- 도시명과 도시의 평균마일리지를 보이시오.
select avg(마일리지) from 고객;
select 도시, avg(마일리지) 평균마일리지
from 고객
group by 도시
having avg(마일리지) > (select avg(마일리지) from 고객);

-- FROM절의 서브쿼리 인라인뷰=================================================================

-- [예제 6-9] 담당자명, 고객회사명, 마일리지, 도시, 해당 도시의 
-- 평균마일리지를 보이시오. 그리고 고객이 위치하는 도시의 평균마일리지와 
-- 각 고객의 마일리지 간의 차이도 함께 보이시오
select 도시, avg(마일리지) 평균마일리지
from 고객
group by 도시;

select 고객.담당자명, 고객.고객회사명, 고객.마일리지, 고객.도시, 도시평균마일리지.평균마일리지, (도시평균마일리지.평균마일리지 - 고객.마일리지) 마일리지_차이
from 고객,
	(select 도시, avg(마일리지) 평균마일리지
		from 고객
		group by 도시) as 도시평균마일리지
where 고객.도시 = 도시평균마일리지.도시;
-- 문제를 읽고 생각해야할 논리적 절차.
-- 1.고객테이블과 도시별요약 테이블이 있따고 생각한다.
-- 2.두 테이블의 공통컬럼 '도시'를 기반으로 조인 조건 작성(inner join 처럼 생각한다.)
-- 3.도시 컬럼이 양쪽에 다 존재하기에 도시를 볼때는 고객.도시 or 도시평균마일리지.도시로 볼 수 있음
-- 4.도시를 공통 컬럼으로 조인하면 각 고객에 대하여 고객이 위치한 도시의 평균마일리지를 행단위로 얻을 수 있다.
-- 5. 고객이 위치한 도시의 편균마일리지와 각 고객의 마일리지의 차이도 구할 수 있다.


-- =======================================================================================
-- 스칼라 서브쿼리 (Scalar subquery)
-- [예제 6-10] 고객번호, 담당자명과 고객의 최종 주문일을 보이시오

SELECT 
	고객.고객번호, 
    고객.담당자명, 
    (
		SELECT MAX(주문.주문일) 
        FROM 주문
        WHERE 주문.고객번호 = 고객.고객번호
        ) AS 최종주문일
FROM 고객;
-- =====================================================================================
-- CTE
-- WITH 도시별요약 AS
-- 	(
--     SELECT 도시
-- 			,AVG(마일리지) AS 도시평균마일리지
-- 	FROM 고객
--     GROUP BY 도시
--     )
--     
--     SELELT...
-- ====================================================================================
-- 상관 서브쿼리
-- [예제 6-12] 사원 테이블에서 사원번호, 사원의 이름, 상사의 사원번호, 
-- 상사의 이름을 보이시오
SELECT 
    사원번호,
    이름,
    상사번호,
    (
        SELECT 이름
        FROM 사원 AS 상사
        WHERE 상사.사원번호 = 사원.상사번호
    ) AS 상사이름
FROM 사원;
-- [예제 6-13] 각 도시마다 최고 마일리지를 보유한 고객의 정보를 보이시오

SELECT 도시, 담당자명, 고객회사명, 마일리지
FROM 고객
WHERE (도시, 마일리지) IN (SELECT 도시, MAX(마일리지) FROM 고객 GROUP BY 도시);

-- =======================================================================
-- 점검문제
select * from 사원;
select * from 부서;
desc 사원;
desc 부서;
select 이름, (select 부서명 from 부서 where 사원.부서번호 = 부서.부서번호) as'부서명'
from 사원
where 사원.이름 = '배재용';
-- 점검문제2
desc 제품;
desc 주문세부;
# 외부 조인 방법
select 제품.*, (제품.재고*제품.단가) 재고금액
from 제품
left outer join 주문세부
on 제품.제품번호 = 주문세부.제품번호
where 주문세부.제품번호 is null;

# 상관 서브 쿼리 방법
select *, p.재고*p.단가 as 재고금액
from 제품 p
where Not exists(select* from 주문세부 d where d.제품번호 = p.제품번호);

-- 점검문제 3
select 담당자명, 고객회사명, 주문건수, 최초주문일, 최종주문일
from 고객
	,(select 고객번호, count(*) 주문건수, min(주문일) 최초주문일, max(주문일) 최종주문일 from 주문 group by 고객번호) as 고객별주문
where 고객.고객번호 = 고객별주문.고객번호;