use hyundai;

-- join 파일의 예제--

-- 5-2
select 사원번호,이름,직위,부서번호
from 사원
where 이름 ='이소미';
select 부서번호, 부서명
from 부서
where 부서번호 ='A1';
-- => 위 관계를 부서번호를 통해서 연결 한뒤에 필요한 정보를 출력(사용) 하겠다.
select 사원번호,이름,직위,사원.부서번호 '사원.사원번호', 부서.부서번호 '부서.부서번호'
from 사원
inner join 부서
on 사원.부서번호 = 부서.부서번호
where 이름 ='이소미';

-- 5-3
-- 먼저 테이블의 정보를 파악하는게 중요하다.
desc 고객;
desc 주문;
select 고객.고객번호, 고객.담당자명, 고객.고객회사명, count(주문.주문번호) as 주문건수
from 고객
inner join 주문
on 고객.고객번호 = 주문.고객번호
group by 고객.고객번호, 고객.담당자명, 고객.고객회사명
order by 4 desc;

-- 5-4
select 고객.고객번호, 고객.담당자명, 고객.고객회사명, sum(주문수량*단가) as 주문금액_합
from 고객
inner join 주문
on 고객.고객번호 = 주문.고객번호
inner join 주문세부
on 주문.주문번호 = 주문세부.주문번호
group by 고객.고객번호, 고객.담당자명, 고객.고객회사명
order by 4 desc;

-- 5-5
-- 사용하는 데이터에 대해서 꼭 확인 하는 습관이 필요하다
select count(*) from 고객;
select 등급명 from 마일리지등급;

select 고객번호,담당자명,마일리지,등급.*
from 고객
cross join 마일리지등급 등급
where 담당자명 ='이은광';

select 고객번호,담당자명,마일리지,등급.*
from 고객
inner join 마일리지등급 등급
on 마일리지 between 하한마일리지 and 상한마일리지
where 담당자명 ='이은광';
-- =======================================
-- 3.외부조인
-- 5-7
select* from 고객;
select* from 사원;
select*from 부서;

-- select 고객번호, 고객회사명, 담당자명, 마일리지, 마일리지 등급
-- from 고객
-- left outer join 부서
-- on 사원.부서번호 = 사원.부서번호
-- where 성별 ='여';
-- 성별이 여 사원에 대해서 사원번호, 사원이름, 부서명 조회
-- 이때 부서번호에 값이 들어있지 않은 사원의 정보도 조회하세요
select 사원번호, 이름, 부서명
from 사원
left outer join 부서
on 사원.부서번호 = 부서.부서번호;
-- ============================================
-- 부서명과 해당 부서와 소속사원 정보를 보이시오
-- 이때 사원이 한 명도 존재하지 않는 부서명이 있다면 부서명도 함께 보이세요
select 사원번호, 이름, 부서명
from 사원
right outer join 부서
on 사원.부서번호 = 부서.부서번호;

select 사원번호, 이름, 부서명
from 부서
left outer join 사원
on 사원.부서번호 = 부서.부서번호;
-- ===================================
-- 사원이 한명도 존재하지 않는 부서명을 찾아내세요
select* from 부서;
select* from 사원;

select 부서명, 사원.*
from 부서
left outer join 사원
on 부서.부서번호 = 사원.부서번호
where 사원번호 is null;
-- ==================================
-- 소속 부서가 없는 사원의 이름을 조회하세요
select 부서.부서명, 사원.*
from 부서
right outer join 사원
on 부서.부서번호 = 사원.부서번호
where 부서.부서번호 is null;
-- =================================
-- 5-11 셀프 조인
select 사원.사원번호, 사원.이름, 상사.사원번호 상사의_사원번호, 상사.이름 상사의_이름
from 사원 as 상사
right outer join 사원
on 사원.상사번호 =상사.사원번호;