# 아래의 메뉴에서 선택한 메뉴를 알려주는 프로그램을 작성하시오

#1 "1. 삽입 2. 수정 3. 삭제 숫자를 선택하세요" 가 출력 되도록한다.
print("1. 삽입","\n2. 수정","\n3. 삭제")
n = int(input("숫자를 선택하세요 > "))
#2 숫자 1~3 이 입력되면 각 숫자에 맞는 삽입 / 수정 / 삭제 을(를)선택하셨습니다. 를 출력한다.
if n == 1:
    print("삽입을 선택하셨습니다.")
elif n == 2:
    print("수정을 선택하셨습니다.")
elif n == 3:
    print("삭제를 선택하셨습니다.")
#3 숫자 1~3 이외의 것을 입력하면 잘못 입력하셨습니다. 출력하게 한다.
else:
    print("잘못 입력하셨습니다.")

#강사님 코드
#1 메뉴 출력
print('1. 삽입')
print('2. 수정')
print('3. 삭제')
#2 사용자로부터 메뉴 번호 입력 받기
userChoise = int(input("숫자를 입력해주세요 "))
#3 선택한 번호에 따라 결과 출력
if userChoise == 1:
    print('삽입 선택')
elif userChoise == 2:
    print('수정 선택')
elif userChoise == 3:
    print('삭제 선택')
else:
    print('잘못된 선택')