# 1. 주사위를 두 번 던져서 나온 수를 입력받아 두 수가 모두 4 이상이면 “이겼습니다.” 한 개만 4 이상이면 “비겼습니다.”
# 모두 4 미만이면 “졌습니다.” 라고 출력하는 프로그램을 작성하시오.
# 모두 4 미만이면 “졌습니다.” 라고 출력하는 프로그램을 작성하시오.

#두 번 값을 받기 위해 input() 두개가 필요하다.
value1 = int(input("첫번째 주사위 값: "))
value2 = int(input("두번쨰 주사위 값: "))
#두수가 모두 4이상이면 이겼습니다.
win = value1 >= 4 and value2 >= 4
#두수가 한개만 4이상이면 비겼습니다.
draw = value1 >= 4 or value2 >= 4
#두수 모두 4 미만이면 졌습니다.
lose = value1 < 4 and value2 < 4

if win :
    print("이겼습니다.")
elif draw :
    print("비겼습니다.")
elif lose :
    print("졌습니다.")