# 한 개의 정수를 입력 받은 후, 입력받은 수를 출력하고 그 수가 10보다 크면 다음 줄에 “10보다 큰 수를 입력하셨습니다.”라는 메시지를 출력하는 프로그램을 작성하시오 
n = int(input("정수를 입력하세요: "))
print("입력된 정수:{}".format(n))
print()
if n > 10:
    print("10보다 큰 수를 입력하셨습니다.")

#
# 0.한 개의 정수를 입력 받은 후
# 1.입력받은 정수를 저장할 변수 선언
# 2.입력을 받으려면 입력기 - input()
number = input("정수를 입력하세요 >")
# 3. 문자열 타입 -> 숫자타입으로 형변환
number = int(number)
# 4. 입력받은 수를 출력
print(number)
# 5. 입력받은 수와 10 을 비교 해서 만약에 입력받은수가 10보다 크다면
if number > 10 :
    print("10보다 큰 수를 입력하셨습니다.")
# 6. 출력> 10보다 큰 수를 입력하셨습니다.