#### 5. 구구단 출력하기 — `[반복문(while) + 제어문]`
# - **문제**: `while`문을 사용해 사용자가 입력한 숫자(2~9)의 구구단을 출력하세요.
# - **출력 예시**: `3 x 1 = 3`, `3 x 2 = 6` ... `3 x 9 = 27`
#======================================================================
count = 1
# 바뀌는 것(단수)과 바뀌지 않는 것(1~9곱하는것=>범위) 구분
# 사용자가 정수를 입력해야하기 때문에 입력란 생성
dan = int(input())

while count<10:
    mult = dan*count
    print(f"{dan} X {count} = {mult}")
    count += 1
# 사용자가 입력하는 단 수는 고정 되어 범위 1~9가 곱해지며 나오는 구구단 출력
# count +=1 을 통해 누적해 9단이 출력되면 while반복이 끝나도록 한다.
