#### 3. 짝수/홀수 분류하기 — `[제어문 + 반복문]`
# - **문제**: 1부터 20까지의 숫자 중 짝수는 `even_list`, 
# 홀수는 `odd_list`에 각각 담아 출력하세요. (`if / else` 사용)
# - **출력 예시**: `짝수: [2, 4, 6, ...] / 홀수: [1, 3, 5, ...]`
#=======================================================================

#1~20 이라는 범위가 주어짐! range를 통해 1~20을 추려낼 수 있음.
even_list = []
odd_list = []
for i in range(1,20+1):
#문제에서 짝수는 even_list / 홀수는 odd_list에 담으라고 조건을 줌
    even_list.append(i) if not(i%2) else odd_list.append(i)
#for문이 다 돌고 나면 짝수는 even에 홀수는 odd에 들어가게 됨.
#위 코드는 삼항비교
print(f"짝수: {even_list} 홀수: {odd_list}")